----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 200, 200]             320
       BatchNorm2d-2         [-1, 32, 200, 200]              64
              ReLU-3         [-1, 32, 200, 200]               0
            Conv2d-4         [-1, 64, 200, 200]          18,496
       BatchNorm2d-5         [-1, 64, 200, 200]             128
              ReLU-6         [-1, 64, 200, 200]               0
         MaxPool2d-7         [-1, 64, 100, 100]               0
            Conv2d-8        [-1, 128, 100, 100]          73,856
       BatchNorm2d-9        [-1, 128, 100, 100]             256
             ReLU-10        [-1, 128, 100, 100]               0
        MaxPool2d-11          [-1, 128, 50, 50]               0
           Conv2d-12          [-1, 256, 50, 50]         295,168
      BatchNorm2d-13          [-1, 256, 50, 50]             512
             ReLU-14          [-1, 256, 50, 50]               0
        MaxPool2d-15          [-1, 256, 25, 25]               0
           Conv2d-16          [-1, 256, 25, 25]         590,080
      BatchNorm2d-17          [-1, 256, 25, 25]             512
             ReLU-18          [-1, 256, 25, 25]               0
        MaxPool2d-19          [-1, 256, 12, 12]               0
           Conv2d-20          [-1, 256, 12, 12]         590,080
      BatchNorm2d-21          [-1, 256, 12, 12]             512
             ReLU-22          [-1, 256, 12, 12]               0
           Conv2d-23           [-1, 16, 12, 12]          36,880
      BatchNorm2d-24           [-1, 16, 12, 12]              32
             ReLU-25           [-1, 16, 12, 12]               0
         Backbone-26                 [-1, 2304]               0
           Linear-27                  [-1, 128]         295,040
           Linear-28                    [-1, 5]             645
        Regressor-29                    [-1, 5]               0
           Linear-27                   [-1, 64]         147,520
          Dropout-28                   [-1, 64]               0
           Linear-29                    [-1, 1]              65
       Classifier-30                    [-1, 1]               0
================================================================
Total params: 2,050,166
Trainable params: 2,050,166
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.15
Forward/backward pass size (MB): 145.24
Params size (MB): 7.26
Estimated Total Size (MB): 152.65
----------------------------------------------------------------
